MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
#define CCP7STAT CCP7STAT
extern volatile uint16_t CCP7STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP7STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP7STATBITS;
extern volatile CCP7STATBITS CCP7STATbits __attribute__((__sfr__));

#define CCP7STATL CCP7STATL
extern volatile uint16_t CCP7STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP7STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP7STATLBITS;
extern volatile CCP7STATLBITS CCP7STATLbits __attribute__((__sfr__));

#define CCP7STATH CCP7STATH
extern volatile uint16_t CCP7STATH __attribute__((__sfr__));
typedef struct tagCCP7STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP7STATHBITS;
extern volatile CCP7STATHBITS CCP7STATHbits __attribute__((__sfr__));

#define CCP7TMRL CCP7TMRL
extern volatile uint16_t CCP7TMRL __attribute__((__sfr__));
#define CCP7TMRH CCP7TMRH
extern volatile uint16_t CCP7TMRH __attribute__((__sfr__));
#define CCP7PRL CCP7PRL
extern volatile uint16_t CCP7PRL __attribute__((__sfr__));
#define CCP7PRH CCP7PRH
extern volatile uint16_t CCP7PRH __attribute__((__sfr__));
#define CCP7RA CCP7RA
extern volatile uint16_t CCP7RA __attribute__((__sfr__));
#define CCP7RAL CCP7RAL
extern volatile uint16_t CCP7RAL __attribute__((__sfr__));
#define CCP7RAH CCP7RAH
extern volatile uint16_t CCP7RAH __attribute__((__sfr__));
#define CCP7RB CCP7RB
extern volatile uint16_t CCP7RB __attribute__((__sfr__));
#define CCP7RBL CCP7RBL
extern volatile uint16_t CCP7RBL __attribute__((__sfr__));
#define CCP7RBH CCP7RBH
extern volatile uint16_t CCP7RBH __attribute__((__sfr__));
#define CCP7BUFL CCP7BUFL
extern volatile uint16_t CCP7BUFL __attribute__((__sfr__));
#define CCP7BUFH CCP7BUFH
extern volatile uint16_t CCP7BUFH __attribute__((__sfr__));

/* Generic structure of entire SFR area for each UART module */
typedef struct tagUART {
        uint16_t uxmode;
        uint16_t uxsta;
        uint16_t uxtxreg;
        uint16_t uxrxreg;
        uint16_t uxbrg;
} UART, *PUART;

#define UxMODEBITS U1MODEBITS
#define UxSTABITS U1STABITS
#define UxTXREGBITS U1TXREGBITS
#define UxRXREGBITS U1RXREGBITS
#define UxBRGBITS U1BRGBITS

#define UART1 UART1
extern volatile UART UART1 __attribute__((__sfr__));

#define U1MODE U1MODE
extern volatile uint16_t U1MODE __attribute__((__sfr__));
__extension__ typedef struct tagU1MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t URXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :1;
      uint16_t RXINV:1;
      uint16_t :3;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U1MODEBITS;
extern volatile U1MODEBITS U1MODEbits __attribute__((__sfr__));

#define U1STA U1STA
extern volatile uint16_t U1STA __attribute__((__sfr__));
__extension__ typedef struct tagU1STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t URXEN:1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U1STABITS;
extern volatile U1STABITS U1STAbits __attribute__((__sfr__));

#define U1TXREG U1TXREG
extern volatile uint16_t U1TXREG __attribute__((__sfr__));
typedef struct tagU1TXREGBITS {
  uint16_t :15;
  uint16_t LAST:1;
} U1TXREGBITS;
extern volatile U1TXREGBITS U1TXREGbits __attribute__((__sfr__));

#define U1RXREG U1RXREG
extern volatile uint16_t U1RXREG __attribute__((__sfr__));
#define U1BRG U1BRG
extern volatile uint16_t U1BRG __attribute__((__sfr__));
#define U1ADMD U1ADMD
extern volatile uint16_t U1ADMD __attribute__((__sfr__));
__extension__ typedef struct tagU1ADMDBITS {
  union {
    struct {
      uint16_t ADMADDR:8;
      uint16_t ADMMASK:8;
    };
    struct {
      uint16_t ADMADDR0:1;
      uint16_t ADMADDR1:1;
      uint16_t ADMADDR2:1;
      uint16_t ADMADDR3:1;
      uint16_t ADMADDR4:1;
      uint16_t ADMADDR5:1;
      uint16_t ADMADDR6:1;
      uint16_t ADMADDR7:1;
      uint16_t ADMMASK0:1;
      uint16_t ADMMASK1:1;
      uint16_t ADMMASK2:1;
      uint16_t ADMMASK3:1;
      uint16_t ADMMASK4:1;
      uint16_t ADMMASK5:1;
      uint16_t ADMMASK6:1;
      uint16_t ADMMASK7:1;
    };
  };
} U1ADMDBITS;
extern volatile U1ADMDBITS U1ADMDbits __attribute__((__sfr__));

#define U1SCCON U1SCCON
extern volatile uint16_t U1SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU1SCCONBITS {
  union {
    struct {
      uint16_t SCEN:1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U1SCCONBITS;
extern volatile U1SCCONBITS U1SCCONbits __attribute__((__sfr__));

#define U1SCINT U1SCINT
extern volatile uint16_t U1SCINT __attribute__((__sfr__));
typedef struct tagU1SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t :2;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t PARIE:1;
  uint16_t :1;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t :2;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U1SCINTBITS;
extern volatile U1SCINTBITS U1SCINTbits __attribute__((__sfr__));

#define U1GTC U1GTC
extern volatile uint16_t U1GTC __attribute__((__sfr__));
__extension__ typedef struct tagU1GTCBITS {
  union {
    struct {
      uint16_t GTC:9;
    };
    struct {
      uint16_t GTC0:1;
      uint16_t GTC1:1;
      uint16_t GTC2:1;
      uint16_t GTC3:1;
      uint16_t GTC4:1;
      uint16_t GTC5:1;
      uint16_t GTC6:1;
      uint16_t GTC7:1;
      uint16_t GTC8:1;
    };
  };
} U1GTCBITS;
extern volatile U1GTCBITS U1GTCbits __attribute__((__sfr__));

#define U1WTCH U1WTCH
extern volatile uint16_t U1WTCH __attribute__((__sfr__));
__extension__ typedef struct tagU1WTCHBITS {
  union {
    struct {
      uint16_t WTCH:8;
    };
    struct {
      uint16_t WTC16:1;
      uint16_t WTC17:1;
      uint16_t WTC18:1;
      uint16_t WTC19:1;
      uint16_t WTC20:1;
      uint16_t WTC21:1;
      uint16_t WTC22:1;
      uint16_t WTC23:1;
    };
  };
} U1WTCHBITS;
extern volatile U1WTCHBITS U1WTCHbits __attribute__((__sfr__));

