MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
/* IPC13 */
#define _INT3IP IPC13bits.INT3IP
#define _INT4IP IPC13bits.INT4IP
#define _CRYDNIP IPC13bits.CRYDNIP
#define _INT3IP0 IPC13bits.INT3IP0
#define _INT3IP1 IPC13bits.INT3IP1
#define _INT3IP2 IPC13bits.INT3IP2
#define _INT4IP0 IPC13bits.INT4IP0
#define _INT4IP1 IPC13bits.INT4IP1
#define _INT4IP2 IPC13bits.INT4IP2
#define _CRYDNIP0 IPC13bits.CRYDNIP0
#define _CRYDNIP1 IPC13bits.CRYDNIP1
#define _CRYDNIP2 IPC13bits.CRYDNIP2

/* IPC14 */
#define _KEYSTRIP IPC14bits.KEYSTRIP
#define _SPI4RXIP IPC14bits.SPI4RXIP
#define _SPI1RXIP IPC14bits.SPI1RXIP
#define _SPI2RXIP IPC14bits.SPI2RXIP
#define _KEYSTRIP0 IPC14bits.KEYSTRIP0
#define _KEYSTRIP1 IPC14bits.KEYSTRIP1
#define _KEYSTRIP2 IPC14bits.KEYSTRIP2
#define _SPI4RXIP0 IPC14bits.SPI4RXIP0
#define _SPI4RXIP1 IPC14bits.SPI4RXIP1
#define _SPI4RXIP2 IPC14bits.SPI4RXIP2
#define _SPI1RXIP0 IPC14bits.SPI1RXIP0
#define _SPI1RXIP1 IPC14bits.SPI1RXIP1
#define _SPI1RXIP2 IPC14bits.SPI1RXIP2
#define _SPI2RXIP0 IPC14bits.SPI2RXIP0
#define _SPI2RXIP1 IPC14bits.SPI2RXIP1
#define _SPI2RXIP2 IPC14bits.SPI2RXIP2

/* IPC15 */
#define _SPI3RXIP IPC15bits.SPI3RXIP
#define _DMA5IP IPC15bits.DMA5IP
#define _RTCIP IPC15bits.RTCIP
#define _CCP1IP IPC15bits.CCP1IP
#define _SPI3RXIP0 IPC15bits.SPI3RXIP0
#define _SPI3RXIP1 IPC15bits.SPI3RXIP1
#define _SPI3RXIP2 IPC15bits.SPI3RXIP2
#define _DMA5IP0 IPC15bits.DMA5IP0
#define _DMA5IP1 IPC15bits.DMA5IP1
#define _DMA5IP2 IPC15bits.DMA5IP2
#define _RTCIP0 IPC15bits.RTCIP0
#define _RTCIP1 IPC15bits.RTCIP1
#define _RTCIP2 IPC15bits.RTCIP2
#define _CCP1IP0 IPC15bits.CCP1IP0
#define _CCP1IP1 IPC15bits.CCP1IP1
#define _CCP1IP2 IPC15bits.CCP1IP2

/* IPC16 */
#define _CCP2IP IPC16bits.CCP2IP
#define _U1ERIP IPC16bits.U1ERIP
#define _U2ERIP IPC16bits.U2ERIP
#define _CRCIP IPC16bits.CRCIP
#define _CCP2IP0 IPC16bits.CCP2IP0
#define _CCP2IP1 IPC16bits.CCP2IP1
#define _CCP2IP2 IPC16bits.CCP2IP2
#define _U1ERIP0 IPC16bits.U1ERIP0
#define _U1ERIP1 IPC16bits.U1ERIP1
#define _U1ERIP2 IPC16bits.U1ERIP2
#define _U2ERIP0 IPC16bits.U2ERIP0
#define _U2ERIP1 IPC16bits.U2ERIP1
#define _U2ERIP2 IPC16bits.U2ERIP2
#define _CRCIP0 IPC16bits.CRCIP0
#define _CRCIP1 IPC16bits.CRCIP1
#define _CRCIP2 IPC16bits.CRCIP2

/* IPC17 */
#define _SI2C3IP IPC17bits.SI2C3IP
#define _MI2C3IP IPC17bits.MI2C3IP
#define _SI2C3IP0 IPC17bits.SI2C3IP0
#define _SI2C3IP1 IPC17bits.SI2C3IP1
#define _SI2C3IP2 IPC17bits.SI2C3IP2
#define _MI2C3IP0 IPC17bits.MI2C3IP0
#define _MI2C3IP1 IPC17bits.MI2C3IP1
#define _MI2C3IP2 IPC17bits.MI2C3IP2

/* IPC18 */
#define _LVDIP IPC18bits.LVDIP
#define _CCP7IP IPC18bits.CCP7IP
#define _LVDIP0 IPC18bits.LVDIP0
#define _LVDIP1 IPC18bits.LVDIP1
#define _LVDIP2 IPC18bits.LVDIP2
#define _CCP7IP0 IPC18bits.CCP7IP0
#define _CCP7IP1 IPC18bits.CCP7IP1
#define _CCP7IP2 IPC18bits.CCP7IP2

/* IPC19 */
#define _CTMUIP IPC19bits.CTMUIP
#define _DAC1IP IPC19bits.DAC1IP
#define _CTMUIP0 IPC19bits.CTMUIP0
#define _CTMUIP1 IPC19bits.CTMUIP1
#define _CTMUIP2 IPC19bits.CTMUIP2
#define _DAC1IP0 IPC19bits.DAC1IP0
#define _DAC1IP1 IPC19bits.DAC1IP1
#define _DAC1IP2 IPC19bits.DAC1IP2

/* IPC20 */
#define _U3ERIP IPC20bits.U3ERIP
#define _U3RXIP IPC20bits.U3RXIP
#define _U3TXIP IPC20bits.U3TXIP
#define _U3ERIP0 IPC20bits.U3ERIP0
#define _U3ERIP1 IPC20bits.U3ERIP1
#define _U3ERIP2 IPC20bits.U3ERIP2
#define _U3RXIP0 IPC20bits.U3RXIP0
#define _U3RXIP1 IPC20bits.U3RXIP1
#define _U3RXIP2 IPC20bits.U3RXIP2
#define _U3TXIP0 IPC20bits.U3TXIP0
#define _U3TXIP1 IPC20bits.U3TXIP1
#define _U3TXIP2 IPC20bits.U3TXIP2

/* IPC21 */
#define _I2C1BCIP IPC21bits.I2C1BCIP
#define _I2C2BCIP IPC21bits.I2C2BCIP
#define _USB1IP IPC21bits.USB1IP
#define _U4ERIP IPC21bits.U4ERIP
#define _I2C1BCIP0 IPC21bits.I2C1BCIP0
#define _I2C1BCIP1 IPC21bits.I2C1BCIP1
#define _I2C1BCIP2 IPC21bits.I2C1BCIP2
#define _I2C2BCIP0 IPC21bits.I2C2BCIP0
#define _I2C2BCIP1 IPC21bits.I2C2BCIP1
#define _I2C2BCIP2 IPC21bits.I2C2BCIP2
#define _USB1IP0 IPC21bits.USB1IP0
#define _USB1IP1 IPC21bits.USB1IP1
#define _USB1IP2 IPC21bits.USB1IP2
#define _U4ERIP0 IPC21bits.U4ERIP0
#define _U4ERIP1 IPC21bits.U4ERIP1
#define _U4ERIP2 IPC21bits.U4ERIP2

/* IPC22 */
#define _U4RXIP IPC22bits.U4RXIP
#define _U4TXIP IPC22bits.U4TXIP
#define _SPI3IP IPC22bits.SPI3IP
#define _SPI3TXIP IPC22bits.SPI3TXIP
#define _U4RXIP0 IPC22bits.U4RXIP0
#define _U4RXIP1 IPC22bits.U4RXIP1
#define _U4RXIP2 IPC22bits.U4RXIP2
#define _U4TXIP0 IPC22bits.U4TXIP0
#define _U4TXIP1 IPC22bits.U4TXIP1
#define _U4TXIP2 IPC22bits.U4TXIP2
#define _SPI3IP0 IPC22bits.SPI3IP0
#define _SPI3IP1 IPC22bits.SPI3IP1
#define _SPI3IP2 IPC22bits.SPI3IP2
#define _SPI3TXIP0 IPC22bits.SPI3TXIP0
#define _SPI3TXIP1 IPC22bits.SPI3TXIP1
#define _SPI3TXIP2 IPC22bits.SPI3TXIP2

/* IPC23 */
#define _SPI4IP IPC23bits.SPI4IP
#define _SPI4TXIP IPC23bits.SPI4TXIP
#define _CCP3IP IPC23bits.CCP3IP
#define _CCP4IP IPC23bits.CCP4IP
#define _SPI4IP0 IPC23bits.SPI4IP0
#define _SPI4IP1 IPC23bits.SPI4IP1
#define _SPI4IP2 IPC23bits.SPI4IP2
#define _SPI4TXIP0 IPC23bits.SPI4TXIP0
#define _SPI4TXIP1 IPC23bits.SPI4TXIP1
#define _SPI4TXIP2 IPC23bits.SPI4TXIP2
#define _CCP3IP0 IPC23bits.CCP3IP0
#define _CCP3IP1 IPC23bits.CCP3IP1
#define _CCP3IP2 IPC23bits.CCP3IP2
#define _CCP4IP0 IPC23bits.CCP4IP0
#define _CCP4IP1 IPC23bits.CCP4IP1
#define _CCP4IP2 IPC23bits.CCP4IP2

/* IPC24 */
#define _CLC1IP IPC24bits.CLC1IP
#define _CLC2IP IPC24bits.CLC2IP
#define _CLC3IP IPC24bits.CLC3IP
#define _CLC4IP IPC24bits.CLC4IP
#define _CLC1IP0 IPC24bits.CLC1IP0
#define _CLC1IP1 IPC24bits.CLC1IP1
#define _CLC1IP2 IPC24bits.CLC1IP2
#define _CLC2IP0 IPC24bits.CLC2IP0
#define _CLC2IP1 IPC24bits.CLC2IP1
#define _CLC2IP2 IPC24bits.CLC2IP2
#define _CLC3IP0 IPC24bits.CLC3IP0
#define _CLC3IP1 IPC24bits.CLC3IP1
#define _CLC3IP2 IPC24bits.CLC3IP2
#define _CLC4IP0 IPC24bits.CLC4IP0
#define _CLC4IP1 IPC24bits.CLC4IP1
#define _CLC4IP2 IPC24bits.CLC4IP2

/* IPC25 */
#define _LCDIP IPC25bits.LCDIP
#define _CCT1IP IPC25bits.CCT1IP
#define _CCT2IP IPC25bits.CCT2IP
#define _LCDIP0 IPC25bits.LCDIP0
#define _LCDIP1 IPC25bits.LCDIP1
#define _LCDIP2 IPC25bits.LCDIP2
#define _CCT1IP0 IPC25bits.CCT1IP0
#define _CCT1IP1 IPC25bits.CCT1IP1
#define _CCT1IP2 IPC25bits.CCT1IP2
#define _CCT2IP0 IPC25bits.CCT2IP0
#define _CCT2IP1 IPC25bits.CCT2IP1
#define _CCT2IP2 IPC25bits.CCT2IP2

/* IPC26 */
#define _FSTIP IPC26bits.FSTIP
#define _FSTIP0 IPC26bits.FSTIP0
#define _FSTIP1 IPC26bits.FSTIP1
#define _FSTIP2 IPC26bits.FSTIP2

/* IPC27 */
#define _I2C3BCIP IPC27bits.I2C3BCIP
#define _RTCCTSIP IPC27bits.RTCCTSIP
#define _U5RXIP IPC27bits.U5RXIP
#define _I2C3BCIP0 IPC27bits.I2C3BCIP0
#define _I2C3BCIP1 IPC27bits.I2C3BCIP1
#define _I2C3BCIP2 IPC27bits.I2C3BCIP2
#define _RTCCTCIP0 IPC27bits.RTCCTCIP0
#define _RTCCTSIP1 IPC27bits.RTCCTSIP1
#define _RTCCTSIP2 IPC27bits.RTCCTSIP2
#define _U5RXIP0 IPC27bits.U5RXIP0
#define _U5RXIP1 IPC27bits.U5RXIP1
#define _U5RXIP2 IPC27bits.U5RXIP2

/* IPC28 */
#define _U5TXIP IPC28bits.U5TXIP
#define _U5ERIP IPC28bits.U5ERIP
#define _U6RXIP IPC28bits.U6RXIP
#define _U6TXIP IPC28bits.U6TXIP
#define _U5TXIP0 IPC28bits.U5TXIP0
#define _U5TXIP1 IPC28bits.U5TXIP1
#define _U5TXIP2 IPC28bits.U5TXIP2
#define _U5ERIP0 IPC28bits.U5ERIP0
#define _U5ERIP1 IPC28bits.U5ERIP1
#define _U5ERIP2 IPC28bits.U5ERIP2
#define _U6RXIP0 IPC28bits.U6RXIP0
#define _U6RXIP1 IPC28bits.U6RXIP1
#define _U6RXIP2 IPC28bits.U6RXIP2
#define _U6TXIP0 IPC28bits.U6TXIP0
#define _U6TXIP1 IPC28bits.U6TXIP1
#define _U6TXIP2 IPC28bits.U6TXIP2

