MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
/* CNPDB */
#define _IOCPDB0 CNPDBbits.IOCPDB0
#define _IOCPDB1 CNPDBbits.IOCPDB1
#define _IOCPDB2 CNPDBbits.IOCPDB2
#define _IOCPDB3 CNPDBbits.IOCPDB3
#define _IOCPDB4 CNPDBbits.IOCPDB4
#define _IOCPDB5 CNPDBbits.IOCPDB5
#define _IOCPDB6 CNPDBbits.IOCPDB6
#define _IOCPDB7 CNPDBbits.IOCPDB7
#define _IOCPDB8 CNPDBbits.IOCPDB8
#define _IOCPDB9 CNPDBbits.IOCPDB9
#define _IOCPDB10 CNPDBbits.IOCPDB10
#define _IOCPDB11 CNPDBbits.IOCPDB11
#define _IOCPDB12 CNPDBbits.IOCPDB12
#define _IOCPDB13 CNPDBbits.IOCPDB13
#define _IOCPDB14 CNPDBbits.IOCPDB14
#define _IOCPDB15 CNPDBbits.IOCPDB15
#define _CNPDB0 CNPDBbits.CNPDB0
#define _CNPDB1 CNPDBbits.CNPDB1
#define _CNPDB2 CNPDBbits.CNPDB2
#define _CNPDB3 CNPDBbits.CNPDB3
#define _CNPDB4 CNPDBbits.CNPDB4
#define _CNPDB5 CNPDBbits.CNPDB5
#define _CNPDB6 CNPDBbits.CNPDB6
#define _CNPDB7 CNPDBbits.CNPDB7
#define _CNPDB8 CNPDBbits.CNPDB8
#define _CNPDB9 CNPDBbits.CNPDB9
#define _CNPDB10 CNPDBbits.CNPDB10
#define _CNPDB11 CNPDBbits.CNPDB11
#define _CNPDB12 CNPDBbits.CNPDB12
#define _CNPDB13 CNPDBbits.CNPDB13
#define _CNPDB14 CNPDBbits.CNPDB14
#define _CNPDB15 CNPDBbits.CNPDB15

/* TRISC */
#define _TRISC1 TRISCbits.TRISC1
#define _TRISC2 TRISCbits.TRISC2
#define _TRISC3 TRISCbits.TRISC3
#define _TRISC4 TRISCbits.TRISC4
#define _TRISC12 TRISCbits.TRISC12
#define _TRISC13 TRISCbits.TRISC13
#define _TRISC14 TRISCbits.TRISC14
#define _TRISC15 TRISCbits.TRISC15

/* PORTC */
#define _RC1 PORTCbits.RC1
#define _RC2 PORTCbits.RC2
#define _RC3 PORTCbits.RC3
#define _RC4 PORTCbits.RC4
#define _RC12 PORTCbits.RC12
#define _RC13 PORTCbits.RC13
#define _RC14 PORTCbits.RC14
#define _RC15 PORTCbits.RC15

/* LATC */
#define _LATC1 LATCbits.LATC1
#define _LATC2 LATCbits.LATC2
#define _LATC3 LATCbits.LATC3
#define _LATC4 LATCbits.LATC4
#define _LATC12 LATCbits.LATC12
#define _LATC15 LATCbits.LATC15

/* ODCC */
#define _ODCC1 ODCCbits.ODCC1
#define _ODCC2 ODCCbits.ODCC2
#define _ODCC3 ODCCbits.ODCC3
#define _ODCC4 ODCCbits.ODCC4
#define _ODCC12 ODCCbits.ODCC12
#define _ODCC15 ODCCbits.ODCC15

/* ANSC */
#define _ANSC1 ANSCbits.ANSC1
#define _ANSC2 ANSCbits.ANSC2
#define _ANSC3 ANSCbits.ANSC3
#define _ANSC4 ANSCbits.ANSC4
#define _ANSELC1 ANSCbits.ANSELC1
#define _ANSELC2 ANSCbits.ANSELC2
#define _ANSELC3 ANSCbits.ANSELC3
#define _ANSELC4 ANSCbits.ANSELC4

/* IOCPC */
/* Bitname _IOCPC1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
#define _IOCPC13 IOCPCbits.IOCPC13
#define _IOCPC14 IOCPCbits.IOCPC14
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */

/* IOCNC */
#define _IOCNC1 IOCNCbits.IOCNC1
#define _IOCNC2 IOCNCbits.IOCNC2
#define _IOCNC3 IOCNCbits.IOCNC3
#define _IOCNC4 IOCNCbits.IOCNC4
#define _IOCNC12 IOCNCbits.IOCNC12
#define _IOCNC13 IOCNCbits.IOCNC13
#define _IOCNC14 IOCNCbits.IOCNC14
#define _IOCNC15 IOCNCbits.IOCNC15

/* IOCFC */
#define _IOCFC1 IOCFCbits.IOCFC1
#define _IOCFC2 IOCFCbits.IOCFC2
#define _IOCFC3 IOCFCbits.IOCFC3
#define _IOCFC4 IOCFCbits.IOCFC4
#define _IOCFC12 IOCFCbits.IOCFC12
#define _IOCFC13 IOCFCbits.IOCFC13
#define _IOCFC14 IOCFCbits.IOCFC14
#define _IOCFC15 IOCFCbits.IOCFC15

/* CNPUC */
/* Bitname _IOCPC1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPC15 cannot be defined because it is used by more than one SFR */
#define _IOCPUC1 CNPUCbits.IOCPUC1
#define _IOCPUC2 CNPUCbits.IOCPUC2
#define _IOCPUC3 CNPUCbits.IOCPUC3
#define _IOCPUC4 CNPUCbits.IOCPUC4
#define _IOCPUC12 CNPUCbits.IOCPUC12
#define _IOCPUC15 CNPUCbits.IOCPUC15
#define _CNPUC1 CNPUCbits.CNPUC1
#define _CNPUC2 CNPUCbits.CNPUC2
#define _CNPUC3 CNPUCbits.CNPUC3
#define _CNPUC4 CNPUCbits.CNPUC4
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _IOCPDC1 CNPDCbits.IOCPDC1
#define _IOCPDC2 CNPDCbits.IOCPDC2
#define _IOCPDC3 CNPDCbits.IOCPDC3
#define _IOCPDC4 CNPDCbits.IOCPDC4
#define _IOCPDC12 CNPDCbits.IOCPDC12
#define _IOCPDC15 CNPDCbits.IOCPDC15
#define _CNPDC1 CNPDCbits.CNPDC1
#define _CNPDC2 CNPDCbits.CNPDC2
#define _CNPDC3 CNPDCbits.CNPDC3
#define _CNPDC4 CNPDCbits.CNPDC4
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC15 CNPDCbits.CNPDC15

/* TRISD */
#define _TRISD0 TRISDbits.TRISD0
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD2 TRISDbits.TRISD2
#define _TRISD3 TRISDbits.TRISD3
#define _TRISD4 TRISDbits.TRISD4
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD7 TRISDbits.TRISD7
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD9 TRISDbits.TRISD9
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD11 TRISDbits.TRISD11
#define _TRISD12 TRISDbits.TRISD12
#define _TRISD13 TRISDbits.TRISD13
#define _TRISD14 TRISDbits.TRISD14
#define _TRISD15 TRISDbits.TRISD15

/* PORTD */
#define _RD0 PORTDbits.RD0
#define _RD1 PORTDbits.RD1
#define _RD2 PORTDbits.RD2
#define _RD3 PORTDbits.RD3
#define _RD4 PORTDbits.RD4
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD7 PORTDbits.RD7
#define _RD8 PORTDbits.RD8
#define _RD9 PORTDbits.RD9
#define _RD10 PORTDbits.RD10
#define _RD11 PORTDbits.RD11
#define _RD12 PORTDbits.RD12
#define _RD13 PORTDbits.RD13
#define _RD14 PORTDbits.RD14
#define _RD15 PORTDbits.RD15

/* LATD */
#define _LATD0 LATDbits.LATD0
#define _LATD1 LATDbits.LATD1
#define _LATD2 LATDbits.LATD2
#define _LATD3 LATDbits.LATD3
#define _LATD4 LATDbits.LATD4
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD7 LATDbits.LATD7
#define _LATD8 LATDbits.LATD8
#define _LATD9 LATDbits.LATD9
#define _LATD10 LATDbits.LATD10
#define _LATD11 LATDbits.LATD11
#define _LATD12 LATDbits.LATD12
#define _LATD13 LATDbits.LATD13
#define _LATD14 LATDbits.LATD14
#define _LATD15 LATDbits.LATD15

