MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
#define _IPC10_OC5IP1_POSITION                   0x00000005
#define _IPC10_OC5IP1_MASK                       0x00000020
#define _IPC10_OC5IP1_LENGTH                     0x00000001

#define _IPC10_OC5IP2_POSITION                   0x00000006
#define _IPC10_OC5IP2_MASK                       0x00000040
#define _IPC10_OC5IP2_LENGTH                     0x00000001

#define _IPC10_OC6IP0_POSITION                   0x00000008
#define _IPC10_OC6IP0_MASK                       0x00000100
#define _IPC10_OC6IP0_LENGTH                     0x00000001

#define _IPC10_OC6IP1_POSITION                   0x00000009
#define _IPC10_OC6IP1_MASK                       0x00000200
#define _IPC10_OC6IP1_LENGTH                     0x00000001

#define _IPC10_OC6IP2_POSITION                   0x0000000A
#define _IPC10_OC6IP2_MASK                       0x00000400
#define _IPC10_OC6IP2_LENGTH                     0x00000001

#define _IPC10_CCT3IP0_POSITION                  0x0000000C
#define _IPC10_CCT3IP0_MASK                      0x00001000
#define _IPC10_CCT3IP0_LENGTH                    0x00000001

#define _IPC10_CCT3IP1_POSITION                  0x0000000D
#define _IPC10_CCT3IP1_MASK                      0x00002000
#define _IPC10_CCT3IP1_LENGTH                    0x00000001

#define _IPC10_CCT3IP2_POSITION                  0x0000000E
#define _IPC10_CCT3IP2_MASK                      0x00004000
#define _IPC10_CCT3IP2_LENGTH                    0x00000001

#define _IPC11_CCT4IP_POSITION                   0x00000000
#define _IPC11_CCT4IP_MASK                       0x00000007
#define _IPC11_CCT4IP_LENGTH                     0x00000003

#define _IPC11_PMPIP_POSITION                    0x00000004
#define _IPC11_PMPIP_MASK                        0x00000070
#define _IPC11_PMPIP_LENGTH                      0x00000003

#define _IPC11_DMA4IP_POSITION                   0x00000008
#define _IPC11_DMA4IP_MASK                       0x00000700
#define _IPC11_DMA4IP_LENGTH                     0x00000003

#define _IPC11_CCT5IP_POSITION                   0x0000000C
#define _IPC11_CCT5IP_MASK                       0x00007000
#define _IPC11_CCT5IP_LENGTH                     0x00000003

#define _IPC11_CCT4IP0_POSITION                  0x00000000
#define _IPC11_CCT4IP0_MASK                      0x00000001
#define _IPC11_CCT4IP0_LENGTH                    0x00000001

#define _IPC11_CCT4IP1_POSITION                  0x00000001
#define _IPC11_CCT4IP1_MASK                      0x00000002
#define _IPC11_CCT4IP1_LENGTH                    0x00000001

#define _IPC11_CCT4IP2_POSITION                  0x00000002
#define _IPC11_CCT4IP2_MASK                      0x00000004
#define _IPC11_CCT4IP2_LENGTH                    0x00000001

#define _IPC11_PMPIP0_POSITION                   0x00000004
#define _IPC11_PMPIP0_MASK                       0x00000010
#define _IPC11_PMPIP0_LENGTH                     0x00000001

#define _IPC11_PMPIP1_POSITION                   0x00000005
#define _IPC11_PMPIP1_MASK                       0x00000020
#define _IPC11_PMPIP1_LENGTH                     0x00000001

#define _IPC11_PMPIP2_POSITION                   0x00000006
#define _IPC11_PMPIP2_MASK                       0x00000040
#define _IPC11_PMPIP2_LENGTH                     0x00000001

#define _IPC11_DMA4IP0_POSITION                  0x00000008
#define _IPC11_DMA4IP0_MASK                      0x00000100
#define _IPC11_DMA4IP0_LENGTH                    0x00000001

#define _IPC11_DMA4IP1_POSITION                  0x00000009
#define _IPC11_DMA4IP1_MASK                      0x00000200
#define _IPC11_DMA4IP1_LENGTH                    0x00000001

#define _IPC11_DMA4IP2_POSITION                  0x0000000A
#define _IPC11_DMA4IP2_MASK                      0x00000400
#define _IPC11_DMA4IP2_LENGTH                    0x00000001

#define _IPC11_CCT5IP0_POSITION                  0x0000000C
#define _IPC11_CCT5IP0_MASK                      0x00001000
#define _IPC11_CCT5IP0_LENGTH                    0x00000001

#define _IPC11_CCT5IP1_POSITION                  0x0000000D
#define _IPC11_CCT5IP1_MASK                      0x00002000
#define _IPC11_CCT5IP1_LENGTH                    0x00000001

#define _IPC11_CCT5IP2_POSITION                  0x0000000E
#define _IPC11_CCT5IP2_MASK                      0x00004000
#define _IPC11_CCT5IP2_LENGTH                    0x00000001

#define _IPC12_CCT6IP_POSITION                   0x00000000
#define _IPC12_CCT6IP_MASK                       0x00000007
#define _IPC12_CCT6IP_LENGTH                     0x00000003

#define _IPC12_SI2C2IP_POSITION                  0x00000004
#define _IPC12_SI2C2IP_MASK                      0x00000070
#define _IPC12_SI2C2IP_LENGTH                    0x00000003

#define _IPC12_MI2C2IP_POSITION                  0x00000008
#define _IPC12_MI2C2IP_MASK                      0x00000700
#define _IPC12_MI2C2IP_LENGTH                    0x00000003

#define _IPC12_CCT7IP_POSITION                   0x0000000C
#define _IPC12_CCT7IP_MASK                       0x00007000
#define _IPC12_CCT7IP_LENGTH                     0x00000003

#define _IPC12_CCT6IP0_POSITION                  0x00000000
#define _IPC12_CCT6IP0_MASK                      0x00000001
#define _IPC12_CCT6IP0_LENGTH                    0x00000001

#define _IPC12_CCT6IP1_POSITION                  0x00000001
#define _IPC12_CCT6IP1_MASK                      0x00000002
#define _IPC12_CCT6IP1_LENGTH                    0x00000001

#define _IPC12_CCT6IP2_POSITION                  0x00000002
#define _IPC12_CCT6IP2_MASK                      0x00000004
#define _IPC12_CCT6IP2_LENGTH                    0x00000001

#define _IPC12_SI2C2IP0_POSITION                 0x00000004
#define _IPC12_SI2C2IP0_MASK                     0x00000010
#define _IPC12_SI2C2IP0_LENGTH                   0x00000001

#define _IPC12_SI2C2IP1_POSITION                 0x00000005
#define _IPC12_SI2C2IP1_MASK                     0x00000020
#define _IPC12_SI2C2IP1_LENGTH                   0x00000001

#define _IPC12_SI2C2IP2_POSITION                 0x00000006
#define _IPC12_SI2C2IP2_MASK                     0x00000040
#define _IPC12_SI2C2IP2_LENGTH                   0x00000001

#define _IPC12_MI2C2IP0_POSITION                 0x00000008
#define _IPC12_MI2C2IP0_MASK                     0x00000100
#define _IPC12_MI2C2IP0_LENGTH                   0x00000001

#define _IPC12_MI2C2IP1_POSITION                 0x00000009
#define _IPC12_MI2C2IP1_MASK                     0x00000200
#define _IPC12_MI2C2IP1_LENGTH                   0x00000001

