MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
#define _DSCON_DSEN_POSITION                     0x0000000F
#define _DSCON_DSEN_MASK                         0x00008000
#define _DSCON_DSEN_LENGTH                       0x00000001

#define _DSWAKE_DSMCLR_POSITION                  0x00000002
#define _DSWAKE_DSMCLR_MASK                      0x00000004
#define _DSWAKE_DSMCLR_LENGTH                    0x00000001

#define _DSWAKE_DSRTCC_POSITION                  0x00000003
#define _DSWAKE_DSRTCC_MASK                      0x00000008
#define _DSWAKE_DSRTCC_LENGTH                    0x00000001

#define _DSWAKE_DSWDT_POSITION                   0x00000004
#define _DSWAKE_DSWDT_MASK                       0x00000010
#define _DSWAKE_DSWDT_LENGTH                     0x00000001

#define _DSWAKE_DSFLT_POSITION                   0x00000007
#define _DSWAKE_DSFLT_MASK                       0x00000080
#define _DSWAKE_DSFLT_LENGTH                     0x00000001

#define _DSWAKE_DSINT0_POSITION                  0x00000008
#define _DSWAKE_DSINT0_MASK                      0x00000100
#define _DSWAKE_DSINT0_LENGTH                    0x00000001

#define _PMCON1_IRQM_POSITION                    0x00000000
#define _PMCON1_IRQM_MASK                        0x00000003
#define _PMCON1_IRQM_LENGTH                      0x00000002

#define _PMCON1_BUSKEEP_POSITION                 0x00000002
#define _PMCON1_BUSKEEP_MASK                     0x00000004
#define _PMCON1_BUSKEEP_LENGTH                   0x00000001

#define _PMCON1_ALMODE_POSITION                  0x00000004
#define _PMCON1_ALMODE_MASK                      0x00000010
#define _PMCON1_ALMODE_LENGTH                    0x00000001

#define _PMCON1_ALP_POSITION                     0x00000005
#define _PMCON1_ALP_MASK                         0x00000020
#define _PMCON1_ALP_LENGTH                       0x00000001

#define _PMCON1_CSF_POSITION                     0x00000006
#define _PMCON1_CSF_MASK                         0x000000C0
#define _PMCON1_CSF_LENGTH                       0x00000002

#define _PMCON1_MODE_POSITION                    0x00000008
#define _PMCON1_MODE_MASK                        0x00000300
#define _PMCON1_MODE_LENGTH                      0x00000002

#define _PMCON1_ADRMUX_POSITION                  0x0000000B
#define _PMCON1_ADRMUX_MASK                      0x00001800
#define _PMCON1_ADRMUX_LENGTH                    0x00000002

#define _PMCON1_PSIDL_POSITION                   0x0000000D
#define _PMCON1_PSIDL_MASK                       0x00002000
#define _PMCON1_PSIDL_LENGTH                     0x00000001

#define _PMCON1_PMPEN_POSITION                   0x0000000F
#define _PMCON1_PMPEN_MASK                       0x00008000
#define _PMCON1_PMPEN_LENGTH                     0x00000001

#define _PMCON1_IRQM0_POSITION                   0x00000000
#define _PMCON1_IRQM0_MASK                       0x00000001
#define _PMCON1_IRQM0_LENGTH                     0x00000001

#define _PMCON1_IRQM1_POSITION                   0x00000001
#define _PMCON1_IRQM1_MASK                       0x00000002
#define _PMCON1_IRQM1_LENGTH                     0x00000001

#define _PMCON1_CSF0_POSITION                    0x00000006
#define _PMCON1_CSF0_MASK                        0x00000040
#define _PMCON1_CSF0_LENGTH                      0x00000001

#define _PMCON1_CSF1_POSITION                    0x00000007
#define _PMCON1_CSF1_MASK                        0x00000080
#define _PMCON1_CSF1_LENGTH                      0x00000001

#define _PMCON1_MODE0_POSITION                   0x00000008
#define _PMCON1_MODE0_MASK                       0x00000100
#define _PMCON1_MODE0_LENGTH                     0x00000001

#define _PMCON1_MODE1_POSITION                   0x00000009
#define _PMCON1_MODE1_MASK                       0x00000200
#define _PMCON1_MODE1_LENGTH                     0x00000001

#define _PMCON1_ADRMUX0_POSITION                 0x0000000B
#define _PMCON1_ADRMUX0_MASK                     0x00000800
#define _PMCON1_ADRMUX0_LENGTH                   0x00000001

#define _PMCON1_ADRMUX1_POSITION                 0x0000000C
#define _PMCON1_ADRMUX1_MASK                     0x00001000
#define _PMCON1_ADRMUX1_LENGTH                   0x00000001

#define _PMCON2_RADDR_POSITION                   0x00000000
#define _PMCON2_RADDR_MASK                       0x000000FF
#define _PMCON2_RADDR_LENGTH                     0x00000008

#define _PMCON2_TIMEOUT_POSITION                 0x0000000C
#define _PMCON2_TIMEOUT_MASK                     0x00001000
#define _PMCON2_TIMEOUT_LENGTH                   0x00000001

#define _PMCON2_ERROR_POSITION                   0x0000000D
#define _PMCON2_ERROR_MASK                       0x00002000
#define _PMCON2_ERROR_LENGTH                     0x00000001

#define _PMCON2_BUSY_POSITION                    0x0000000F
#define _PMCON2_BUSY_MASK                        0x00008000
#define _PMCON2_BUSY_LENGTH                      0x00000001

#define _PMCON2_RADDR16_POSITION                 0x00000000
#define _PMCON2_RADDR16_MASK                     0x00000001
#define _PMCON2_RADDR16_LENGTH                   0x00000001

#define _PMCON2_RADDR17_POSITION                 0x00000001
#define _PMCON2_RADDR17_MASK                     0x00000002
#define _PMCON2_RADDR17_LENGTH                   0x00000001

#define _PMCON2_RADDR18_POSITION                 0x00000002
#define _PMCON2_RADDR18_MASK                     0x00000004
#define _PMCON2_RADDR18_LENGTH                   0x00000001

#define _PMCON2_RADDR19_POSITION                 0x00000003
#define _PMCON2_RADDR19_MASK                     0x00000008
#define _PMCON2_RADDR19_LENGTH                   0x00000001

#define _PMCON2_RADDR20_POSITION                 0x00000004
#define _PMCON2_RADDR20_MASK                     0x00000010
#define _PMCON2_RADDR20_LENGTH                   0x00000001

#define _PMCON2_RADDR21_POSITION                 0x00000005
#define _PMCON2_RADDR21_MASK                     0x00000020
#define _PMCON2_RADDR21_LENGTH                   0x00000001

#define _PMCON2_RADDR22_POSITION                 0x00000006
#define _PMCON2_RADDR22_MASK                     0x00000040
#define _PMCON2_RADDR22_LENGTH                   0x00000001

