MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GB410/mcu.h
#define _LCDDATA16_S10C4_POSITION                0x0000000A
#define _LCDDATA16_S10C4_MASK                    0x00000400
#define _LCDDATA16_S10C4_LENGTH                  0x00000001

#define _LCDDATA16_S11C4_POSITION                0x0000000B
#define _LCDDATA16_S11C4_MASK                    0x00000800
#define _LCDDATA16_S11C4_LENGTH                  0x00000001

#define _LCDDATA16_S12C4_POSITION                0x0000000C
#define _LCDDATA16_S12C4_MASK                    0x00001000
#define _LCDDATA16_S12C4_LENGTH                  0x00000001

#define _LCDDATA16_S13C4_POSITION                0x0000000D
#define _LCDDATA16_S13C4_MASK                    0x00002000
#define _LCDDATA16_S13C4_LENGTH                  0x00000001

#define _LCDDATA16_S14C4_POSITION                0x0000000E
#define _LCDDATA16_S14C4_MASK                    0x00004000
#define _LCDDATA16_S14C4_LENGTH                  0x00000001

#define _LCDDATA16_S15C4_POSITION                0x0000000F
#define _LCDDATA16_S15C4_MASK                    0x00008000
#define _LCDDATA16_S15C4_LENGTH                  0x00000001

#define _LCDDATA17_S16C4_POSITION                0x00000000
#define _LCDDATA17_S16C4_MASK                    0x00000001
#define _LCDDATA17_S16C4_LENGTH                  0x00000001

#define _LCDDATA17_S17C4_POSITION                0x00000001
#define _LCDDATA17_S17C4_MASK                    0x00000002
#define _LCDDATA17_S17C4_LENGTH                  0x00000001

#define _LCDDATA17_S18C4_POSITION                0x00000002
#define _LCDDATA17_S18C4_MASK                    0x00000004
#define _LCDDATA17_S18C4_LENGTH                  0x00000001

#define _LCDDATA17_S19C4_POSITION                0x00000003
#define _LCDDATA17_S19C4_MASK                    0x00000008
#define _LCDDATA17_S19C4_LENGTH                  0x00000001

#define _LCDDATA17_S20C4_POSITION                0x00000004
#define _LCDDATA17_S20C4_MASK                    0x00000010
#define _LCDDATA17_S20C4_LENGTH                  0x00000001

#define _LCDDATA17_S21C4_POSITION                0x00000005
#define _LCDDATA17_S21C4_MASK                    0x00000020
#define _LCDDATA17_S21C4_LENGTH                  0x00000001

#define _LCDDATA17_S22C4_POSITION                0x00000006
#define _LCDDATA17_S22C4_MASK                    0x00000040
#define _LCDDATA17_S22C4_LENGTH                  0x00000001

#define _LCDDATA17_S23C4_POSITION                0x00000007
#define _LCDDATA17_S23C4_MASK                    0x00000080
#define _LCDDATA17_S23C4_LENGTH                  0x00000001

#define _LCDDATA17_S24C4_POSITION                0x00000008
#define _LCDDATA17_S24C4_MASK                    0x00000100
#define _LCDDATA17_S24C4_LENGTH                  0x00000001

#define _LCDDATA17_S25C4_POSITION                0x00000009
#define _LCDDATA17_S25C4_MASK                    0x00000200
#define _LCDDATA17_S25C4_LENGTH                  0x00000001

#define _LCDDATA17_S26C4_POSITION                0x0000000A
#define _LCDDATA17_S26C4_MASK                    0x00000400
#define _LCDDATA17_S26C4_LENGTH                  0x00000001

#define _LCDDATA17_S27C4_POSITION                0x0000000B
#define _LCDDATA17_S27C4_MASK                    0x00000800
#define _LCDDATA17_S27C4_LENGTH                  0x00000001

#define _LCDDATA17_S28C4_POSITION                0x0000000C
#define _LCDDATA17_S28C4_MASK                    0x00001000
#define _LCDDATA17_S28C4_LENGTH                  0x00000001

#define _LCDDATA17_S29C4_POSITION                0x0000000D
#define _LCDDATA17_S29C4_MASK                    0x00002000
#define _LCDDATA17_S29C4_LENGTH                  0x00000001

#define _LCDDATA17_S30C4_POSITION                0x0000000E
#define _LCDDATA17_S30C4_MASK                    0x00004000
#define _LCDDATA17_S30C4_LENGTH                  0x00000001

#define _LCDDATA17_S31C4_POSITION                0x0000000F
#define _LCDDATA17_S31C4_MASK                    0x00008000
#define _LCDDATA17_S31C4_LENGTH                  0x00000001

#define _LCDDATA18_S32C4_POSITION                0x00000000
#define _LCDDATA18_S32C4_MASK                    0x00000001
#define _LCDDATA18_S32C4_LENGTH                  0x00000001

#define _LCDDATA18_S33C4_POSITION                0x00000001
#define _LCDDATA18_S33C4_MASK                    0x00000002
#define _LCDDATA18_S33C4_LENGTH                  0x00000001

#define _LCDDATA18_S34C4_POSITION                0x00000002
#define _LCDDATA18_S34C4_MASK                    0x00000004
#define _LCDDATA18_S34C4_LENGTH                  0x00000001

#define _LCDDATA18_S35C4_POSITION                0x00000003
#define _LCDDATA18_S35C4_MASK                    0x00000008
#define _LCDDATA18_S35C4_LENGTH                  0x00000001

#define _LCDDATA18_S36C4_POSITION                0x00000004
#define _LCDDATA18_S36C4_MASK                    0x00000010
#define _LCDDATA18_S36C4_LENGTH                  0x00000001

#define _LCDDATA18_S37C4_POSITION                0x00000005
#define _LCDDATA18_S37C4_MASK                    0x00000020
#define _LCDDATA18_S37C4_LENGTH                  0x00000001

#define _LCDDATA18_S38C4_POSITION                0x00000006
#define _LCDDATA18_S38C4_MASK                    0x00000040
#define _LCDDATA18_S38C4_LENGTH                  0x00000001

#define _LCDDATA18_S39C4_POSITION                0x00000007
#define _LCDDATA18_S39C4_MASK                    0x00000080
#define _LCDDATA18_S39C4_LENGTH                  0x00000001

#define _LCDDATA18_S40C4_POSITION                0x00000008
#define _LCDDATA18_S40C4_MASK                    0x00000100
#define _LCDDATA18_S40C4_LENGTH                  0x00000001

#define _LCDDATA18_S41C4_POSITION                0x00000009
#define _LCDDATA18_S41C4_MASK                    0x00000200
#define _LCDDATA18_S41C4_LENGTH                  0x00000001

#define _LCDDATA18_S42C4_POSITION                0x0000000A
#define _LCDDATA18_S42C4_MASK                    0x00000400
#define _LCDDATA18_S42C4_LENGTH                  0x00000001

#define _LCDDATA18_S43C4_POSITION                0x0000000B
#define _LCDDATA18_S43C4_MASK                    0x00000800
#define _LCDDATA18_S43C4_LENGTH                  0x00000001

#define _LCDDATA18_S44C4_POSITION                0x0000000C
#define _LCDDATA18_S44C4_MASK                    0x00001000
#define _LCDDATA18_S44C4_LENGTH                  0x00000001

#define _LCDDATA18_S45C4_POSITION                0x0000000D
#define _LCDDATA18_S45C4_MASK                    0x00002000
#define _LCDDATA18_S45C4_LENGTH                  0x00000001

#define _LCDDATA18_S46C4_POSITION                0x0000000E
#define _LCDDATA18_S46C4_MASK                    0x00004000
#define _LCDDATA18_S46C4_LENGTH                  0x00000001

#define _LCDDATA18_S47C4_POSITION                0x0000000F
#define _LCDDATA18_S47C4_MASK                    0x00008000
#define _LCDDATA18_S47C4_LENGTH                  0x00000001

#define _LCDDATA19_S48C4_POSITION                0x00000000
#define _LCDDATA19_S48C4_MASK                    0x00000001
#define _LCDDATA19_S48C4_LENGTH                  0x00000001

#define _LCDDATA19_S49C4_POSITION                0x00000001
#define _LCDDATA19_S49C4_MASK                    0x00000002
#define _LCDDATA19_S49C4_LENGTH                  0x00000001

